In [2]:
#this code comes under Pandas and csv:1
import pandas as pd
data={'Sn':[1,2,3],
      'Name':['Ram','Shyam','Sita'],
      'Age':[23,45,34],
      'Address':['Kathmandu','Patan','Bhaktapur']}
df=pd.DataFrame(data)
df

   Sn   Name  Age    Address
0   1    Ram   23  Kathmandu
1   2  Shyam   45      Patan
2   3   Sita   34  Bhaktapur

In [3]:
df.to_csv('info.csv')

In [ ]:
#this code comes under Pandas and csv:2
import pandas as pd
data={'Sn':[1,2,3],
      'Name':['Ram','','Sita'],
      'Age':[23,45,34],
      'Address':['Kathmandu','Patan','Bhaktapur']}
df=pd.DataFrame(data)
df

In [8]:

#this code comes under Pandas and csv:2
import pandas as pd
data={'Sn':[1,2,3],
      'Name':['Ram','Shyam','Sita'],
      'Age':[23,None,34],
      'Address':['Kathmandu','Patan','Bhaktapur']}
df=pd.DataFrame(data)
df

   Sn   Name   Age    Address
0   1    Ram  23.0  Kathmandu
1   2  Shyam   NaN      Patan
2   3   Sita  34.0  Bhaktapur

In [10]:
#from here conversion  of Dict and List is started
import csv
fields =[['','','Adress'],
         ['kamal','',''],
         ['Ram',34,'Kathmandu']]
with open('books.csv','w') as f:
    x=csv.writer(f)
    for i in fields:
        x.writerow(i)

In [23]:
import csv 
with open('books.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        print(dict(row))

{'Name': 'kamal', 'Age': '32', 'Adress': 'Jhapa'}
{'Name': 'Ram', 'Age': '34', 'Adress': 'Kathmandu'}

In [5]:
import pandas as pd
df1 = pd.DataFrame({'Names': ['Andreas', 'George', 'Steve',
'Sarah', 'Joanna', 'Hanna'],
'Age':[21, 22, 20, 19, 18, 23]})
df2 = pd.DataFrame({'Names': ['Pete', 'Jordan', 'Gustaf',
'Sophie', 'Sally', 'Simone'],
'Age':[22, 21, 19, 19, 29, 21]})
df3 = pd.DataFrame({'Names': ['Ulrich', 'Donald', 'Jon',
'Jessica', 'Elisabeth', 'Diana'],
'Age':[21, 21, 20, 19, 19, 22]})

df = pd.concat([df1, df2, df3])
df.to_csv('boooks.csv')
df

       Names  Age
0    Andreas   21
1     George   22
2      Steve   20
3      Sarah   19
4     Joanna   18
5      Hanna   23
0       Pete   22
1     Jordan   21
2     Gustaf   19
3     Sophie   19
4      Sally   29
5     Simone   21
0     Ulrich   21
1     Donald   21
2        Jon   20
3    Jessica   19
4  Elisabeth   19
5      Diana   22

In [13]:
import csv
fields=['Kamal','28','Baluwatar']
with open ('books.csv','a')as f:
    x=csv.writer(f)
    x.writerow(fields)

In [12]:
import csv
data=[['Name','Age','Adress'],
     ['Ram','34','Kathmandu'],
     ['Shyam',45,'Kathmandu']]
with open('book.csv','a') as f:
    x=csv.writer(f)
    for i in fields:
        x.writerow(i)

In [27]:
import csv
fields =[['Name','Age','Adress'],
         ['kamal','32','Jhapa'],
         ['Ram',34,'Kathmandu']]
with open('books.csv','w') as f:
    x=csv.writer(f)
    for i in fields:
        x.write(i)

AttributeError: '_csv.writer' object has no attribute 'writecol'

In [22]:
import csv
with open('books.csv') as csvfile:
    reader=csv.DictReader(csvfile)
    for row in reader:
        print(dict(row))

{'Name': 'kamal', 'Age': '32', 'Adress': 'Jhapa'}
{'Name': 'Ram', 'Age': '34', 'Adress': 'Kathmandu'}

In [26]:
import csv
all_data=[]
with open('books.csv') as csvfile:
    reader=csv.DictReader(csvfile)
    for row in reader:
        all_data.append(dict(row))
        
all_data

[{'Name': 'kamal', 'Age': '32', 'Adress': 'Jhapa'},
 {'Name': 'Ram', 'Age': '34', 'Adress': 'Kathmandu'}]

In [30]:
import pandas as pd
df1=pd.DataFrame({'Name':['Ram','Hari','Shyam'],
                 'Age':[23,34,45]})
df2=pd.DataFrame({'Name':['Gita','Sita','Laxmi'],
                 'Age':[23,28,27]})
df3=pd.DataFrame({'Name':['Andreus','Harry','Ron'],
                 'Age':[34,30,35]})
df=pd.concat([df1,df2,df3])

df.to_csv('books.csv')

df

      Name  Age
0      Ram   23
1     Hari   34
2    Shyam   45
0     Gita   23
1     Sita   28
2    Laxmi   27
0  Andreus   34
1    Harry   30
2      Ron   35